import * as React from 'react'
import { Collapse } from '../../../../libs'

export default () => {
  return (
    <div className="h-full">
      <Collapse accordion={true}>
        <Collapse.Item title="Collapse first">
          <div className="p-20">
            与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
            在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            <div>
              与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
              在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            </div>
          </div>
        </Collapse.Item>
        <Collapse.Item title="Collapse first">
          <div className="p-20">
            与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
            在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            <div>
              与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
              在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            </div>
          </div>
        </Collapse.Item>
        <Collapse.Item title="Collapse first">
          <div className="p-20">
            与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
            在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            <div>
              与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
              在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            </div>
          </div>
          <div className="p-20">
            与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
            在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            <div>
              与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
              在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            </div>
          </div>
        </Collapse.Item>
        <Collapse.Item title="Collapse first">
          <div className="p-20">
            与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
            在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            <div>
              与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
              在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            </div>
          </div>
          <div className="p-20">
            与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
            在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            <div>
              与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
              在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
            </div>
          </div>
        </Collapse.Item>
      </Collapse>

      <div className="m-t-100">
        <Collapse accordion={false}>
          <Collapse.Item title="Collapse first">
            <div className="p-20">
              与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
              在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
              <div>
                与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
                在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
              </div>
            </div>
          </Collapse.Item>
          <Collapse.Item title="Collapse first">
            <div className="p-20">
              与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
              在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
              <div>
                与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；
                在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。
              </div>
            </div>
          </Collapse.Item>
        </Collapse>
      </div>
    </div>
  )
}
